[
  {
    "Link": "https://www.alignment-workshop.com/nola-2023#h.qvhufi1ane9m",
    "ML Subfield": [
      "Probabilistic Modeling and Bayesian ML",
      "Theory",
      "Reinforcement Learning"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)"
    ],
    "Title": "Towards Quantitative Safety Guarantees and Alignment (Yoshua Bengio, 59-min video)",
    "Type": [
      "Video"
    ]
  },
  {
    "Blog or Video": "https://www.anthropic.com/news/sleeper-agents-training-deceptive-llms-that-persist-through-safety-training",
    "Link": "https://arxiv.org/abs/2401.05566",
    "ML Subfield": [
      "NLP",
      "Robustness and Adversariality"
    ],
    "Safety Category": [
      "Adversaries / Robustness / Generalization",
      "Model evaluations / monitoring / detection",
      "Deception"
    ],
    "Title": "Sleeper Agents: Training Deceptive LLMs that Persist Through Safety Training (Hubinger et al., 2024)\n",
    "Type": [
      "Paper"
    ],
    "Twitter": "https://twitter.com/AnthropicAI/status/1745854907968880970",
    "Abstract": "Humans are capable of strategically deceptive behavior: behaving helpfully in most situations, but then behaving very differently in order to pursue alternative objectives when given the opportunity. If an AI system learned such a deceptive strategy, could we detect it and remove it using current state-of-the-art safety training techniques? To study this question, we construct proof-of-concept examples of deceptive behavior in large language models (LLMs). For example, we train models that write secure code when the prompt states that the year is 2023, but insert exploitable code when the stated year is 2024. We find that such backdoor behavior can be made persistent, so that it is not removed by standard safety training techniques, including supervised fine-tuning, reinforcement learning, and adversarial training (eliciting unsafe behavior and then training to remove it). The backdoor behavior is most persistent in the largest models and in models trained to produce chain-of-thought reasoning about deceiving the training process, with the persistence remaining even when the chain-of-thought is distilled away. Furthermore, rather than removing backdoors, we find that adversarial training can teach models to better recognize their backdoor triggers, effectively hiding the unsafe behavior. Our results suggest that, once a model exhibits deceptive behavior, standard techniques could fail to remove such deception and create a false impression of safety.\n"
  },
  {
    "Link": "https://arxiv.org/abs/2109.13916",
    "ML Subfield": [
      "Robustness and Adversariality",
      "Theory",
      "Applied ML",
      "Human Model Interaction"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)",
      "Overview"
    ],
    "Title": "Unsolved Problems in ML safety (Hendrycks et al., 2021)",
    "Type": [
      "Paper"
    ],
    "Abstract": "Machine learning (ML) systems are rapidly increasing in size, are acquiring new capabilities, and are increasingly deployed in high-stakes settings. As with other powerful technologies, safety for ML should be a leading research priority. In response to emerging safety challenges in ML, such as those introduced by recent large-scale models, we provide a new roadmap for ML Safety and refine the technical problems that the field needs to address. We present four problems ready for research, namely withstanding hazards (“Robustness”), identifying hazards (“Monitoring”), steering ML systems (“Alignment”), and reducing deployment hazards (“Systemic Safety”). Throughout, we clarify each problem’s motivation and provide concrete research directions.\n"
  },
  {
    "Link": "https://arxiv.org/abs/2306.03819",
    "ML Subfield": [
      "Applied ML",
      "Theory"
    ],
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge"
    ],
    "Safety Topic": [
      "Model editing"
    ],
    "Title": "LEACE: Perfect linear concept erasure in closed form (Belrose et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": " Concept erasure aims to remove specified features from a representation. It can improve fairness (e.g. preventing a classifier from using gender or race) and interpretability (e.g. removing a concept to observe changes in model behavior). We introduce LEAst-squares Concept Erasure (LEACE), a closed-form method which provably prevents all linear classifiers from detecting a concept while changing the representation as little as possible, as measured by a broad class of norms. We apply LEACE to large language models with a novel procedure called \"concept scrubbing,\" which erases target concept information from every layer in the network. We demonstrate our method on two tasks: measuring the reliance of language models on part-of-speech information, and reducing gender bias in BERT embeddings. Code is available at this https URL. \n"
  },
  {
    "Link": "https://arxiv.org/abs/2304.00612",
    "ML Subfield": [
      "NLP"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Capabilities of LLMs",
      "Major problems (misalignment, misuse, threat models)"
    ],
    "Title": "Eight Things to Know about Large Language Models (Bowman, 2023)",
    "Type": [
      "Paper"
    ],
    "Twitter": "https://twitter.com/sleepinyourhat/status/1642614846796734464",
    "Abstract": "The widespread public deployment of large language models (LLMs) in recent months has prompted a wave of new attention and engagement from advocates, policymakers, and scholars from many fields. This attention is a timely response to the many urgent questions that this technology raises, but it can sometimes miss important considerations. This paper surveys the evidence for eight potentially surprising such points: \n1\\. LLMs predictably get more capable with increasing investment, even without targeted innovation.\n 2\\. Many important LLM behaviors emerge unpredictably as a byproduct of increasing investment.\n 3\\. LLMs often appear to learn and use representations of the outside world.\n 4\\. There are no reliable techniques for steering the behavior of LLMs.\n 5\\. Experts are not yet able to interpret the inner workings of LLMs. 6. Human performance on a task isn’t an upper bound on LLM performance. \n7\\. LLMs need not express the values of their creators nor the values encoded in web text. 8. Brief interactions with LLMs are often misleading.\n"
  },
  {
    "Link": "https://www.safe.ai/ai-risk",
    "ML Subfield": [
      "Domain General",
      "Applied ML"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)",
      "Overview"
    ],
    "Title": "An Overview of Catastrophic AI Risks (Hendrycks et al., 2023)",
    "Type": [
      "Blog post",
      "Paper"
    ],
    "Abstract": "Rapid advancements in artificial intelligence (AI) have sparked growing concerns among experts, policymakers, and world leaders regarding the potential for increasingly advanced AI systems to pose catastrophic risks. Although numerous risks have been detailed separately, there is a pressing need for a systematic discussion and illustration of the potential dangers to better inform efforts to mitigate them. This paper provides an overview of the main sources of catastrophic AI risks, which we organize into four categories: malicious use, in which individuals or groups intentionally use AIs to cause harm; AI race, in which competitive environments compel actors to deploy unsafe AIs or cede control to AIs; organizational risks, highlighting how human factors and complex systems can increase the chances of catastrophic accidents; and rogue AIs, describing the inherent difficulty in controlling agents far more intelligent than humans. For each category of risk, we describe specific hazards, present illustrative stories, envision ideal scenarios, and propose practical suggestions for mitigating these dangers. Our goal is to foster a comprehensive understanding of these risks and inspire collective and proactive efforts to ensure that AIs are developed and deployed in a safe manner. Ultimately, we hope this will allow us to realize the benefits of this powerful technology while minimizing the potential for catastrophic outcomes.\n",
    "Transcripts / Audio / Slides": "https://www.safe.ai/ai-risk"
  },
  {
    "Link": "https://arxiv.org/abs/2310.03693",
    "Safety Category": [
      "Alignment <-> RLHF"
    ],
    "Title": "Fine-tuning Aligned Language Models Compromises Safety, Even When Users Do Not Intend To! (Qi et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "Optimizing large language models (LLMs) for downstream use cases often involves the customization of pre-trained LLMs through further fine-tuning. Meta's open release of Llama models and OpenAI's APIs for fine-tuning GPT-3.5 Turbo on custom datasets also encourage this practice. But, what are the safety costs associated with such custom fine-tuning? We note that while existing safety alignment infrastructures can restrict harmful behaviors of LLMs at inference time, they do not cover safety risks when fine-tuning privileges are extended to end-users. Our red teaming studies find that the safety alignment of LLMs can be compromised by fine-tuning with only a few adversarially designed training examples. For instance, we jailbreak GPT-3.5 Turbo's safety guardrails by fine-tuning it on only 10 such examples at a cost of less than $0.20 via OpenAI's APIs, making the model responsive to nearly any harmful instructions. Disconcertingly, our research also reveals that, even without malicious intent, simply fine-tuning with benign and commonly used datasets can also inadvertently degrade the safety alignment of LLMs, though to a lesser extent. These findings suggest that fine-tuning aligned LLMs introduces new safety risks that current safety infrastructures fall short of addressing -- even if a model's initial safety alignment is impeccable, it is not necessarily to be maintained after custom fine-tuning. We outline and critically analyze potential mitigations and advocate for further research efforts toward reinforcing safety protocols for the custom fine-tuning of aligned LLMs. \n"
  },
  {
    "Link": "https://arxiv.org/abs/2311.17035",
    "ML Subfield": [
      "Robustness and Adversariality",
      "Security",
      "Applied ML"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Adversaries / Robustness / Generalization"
    ],
    "Title": "Scalable Extraction of Training Data from (Production) Language Models (Nasr et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "    This paper studies extractable memorization: training data that an adversary can efficiently extract by querying a machine learning model without prior knowledge of the training dataset. We show an adversary can extract gigabytes of training data from open-source language models like Pythia or GPT-Neo, semi-open models like LLaMA or Falcon, and closed models like ChatGPT. Existing techniques from the literature suffice to attack unaligned models; in order to attack the aligned ChatGPT, we develop a new divergence attack that causes the model to diverge from its chatbot-style generations and emit training data at a rate 150x higher than when behaving properly. Our methods show practical attacks can recover far more data than previously thought, and reveal that current alignment techniques do not eliminate memorization. \n"
  },
  {
    "Link": "https://bounded-regret.ghost.io/complex-systems-are-hard-to-control/",
    "ML Subfield": [
      "Applied ML",
      "Human Model Interaction"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)"
    ],
    "Title": "Complex Systems are Hard to Control (Steinhart, 2023)",
    "Type": [
      "Blog post"
    ]
  },
  {
    "Link": "https://www.youtube.com/watch?v=m1gbzNQ4JRI&t=2249s",
    "ML Subfield": [
      "NLP"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)",
      "Overview"
    ],
    "Title": "Aligning Massive Models: Current and Future Challenges (Jacob Steinhardt, 66-min video)",
    "Type": [
      "Video"
    ],
    "Transcripts / Audio / Slides": "https://jsteinhardt.stat.berkeley.edu/talks/satml/tutorial.html#slideIndex=0&level=0"
  },
  {
    "Link": "https://arxiv.org/abs/2307.15217",
    "ML Subfield": [
      "Reinforcement Learning",
      "Applied ML",
      "Human Model Interaction"
    ],
    "Safety Category": [
      "Reward misspecification and goal misgeneralization",
      "Alignment <-> RLHF"
    ],
    "Title": "Open Problems and Fundamental Limitations of Reinforcement Learning from Human Feedback (Casper et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Twitter": "https://twitter.com/StephenLCasper/status/1686036515653361664",
    "Abstract": "Reinforcement learning from human feedback (RLHF) is a technique for training AI systems to align with human goals. RLHF has emerged as the central method used to finetune state-of-the-art large language models (LLMs). Despite this popularity, there has been relatively little public work systematizing its flaws. In this paper, we (1) survey open problems and fundamental limitations of RLHF and related methods; (2) overview techniques to understand, improve, and complement RLHF in practice; and (3) propose auditing and disclosure standards to improve societal oversight of RLHF systems. Our work emphasizes the limitations of RLHF and highlights the importance of a multi-faceted approach to the development of safer AI systems. \n"
  },
  {
    "Blog or Video": "https://www.youtube.com/watch?v=HiYWwjma3xE&t=1687s",
    "Link": "https://arxiv.org/abs/2212.09251",
    "ML Subfield": [
      "Model Evaluation",
      "NLP"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Model evaluations / monitoring / detection",
      "Scalable oversight"
    ],
    "Title": "Discovering Language Model Behaviors with Model-Written Evaluations (Perez et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "As language models (LMs) scale, they develop many novel behaviors, good and bad, exacerbating the need to evaluate how they behave. Prior work creates evaluations with crowdwork (which is time-consuming and expensive) or existing data sources (which are not always available). Here, we automatically generate evaluations with LMs. We explore approaches with varying amounts of human effort, from instructing LMs to write yes/no questions to making complex Winogender schemas with multiple stages of LM-based generation and filtering. Crowdworkers rate the examples as highly relevant and agree with 90-100% of labels, sometimes more so than corresponding human-written datasets. We generate 154 datasets and discover new cases of inverse scaling where LMs get worse with size. Larger LMs repeat back a dialog user's preferred answer (\"sycophancy\") and express greater desire to pursue concerning goals like resource acquisition and goal preservation. We also find some of the first examples of inverse scaling in RL from Human Feedback (RLHF), where more RLHF makes LMs worse. For example, RLHF makes LMs express stronger political views (on gun rights and immigration) and a greater desire to avoid shut down. Overall, LM-written evaluations are high-quality and let us quickly discover many novel LM behaviors. \n"
  },
  {
    "Link": "https://www.youtube.com/watch?v=Vb5g7jlNzOk&t=438s",
    "ML Subfield": [
      "Model Evaluation"
    ],
    "ML Subtopic": [
      "NLP: LLMs",
      "Applied ML: Chatbots"
    ],
    "Safety Category": [
      "Model evaluations / monitoring / detection"
    ],
    "Title": "Safety evaluations and standards for AI (Beth Barnes, 32-min video)",
    "Type": [
      "Video"
    ]
  },
  {
    "Link": "https://arxiv.org/abs/2110.03605",
    "ML Subfield": [
      "Robustness and Adversariality",
      "Vision"
    ],
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge"
    ],
    "Title": "Robust Feature-Level Adversaries are Interpretability Tools (Casper et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Twitter": "https://twitter.com/StephenLCasper/status/1598029118205218816",
    "Abstract": "The literature on adversarial attacks in computer vision typically focuses on pixel-level perturbations. These tend to be very difficult to interpret. Recent work that manipulates the latent representations of image generators to create \"feature-level\" adversarial perturbations gives us an opportunity to explore perceptible, interpretable adversarial attacks. We make three contributions. First, we observe that feature-level attacks provide useful classes of inputs for studying representations in models. Second, we show that these adversaries are uniquely versatile and highly robust. We demonstrate that they can be used to produce targeted, universal, disguised, physically-realizable, and black-box attacks at the ImageNet scale. Third, we show how these adversarial images can be used as a practical interpretability tool for identifying bugs in networks. We use these adversaries to make predictions about spurious associations between features and classes which we then test by designing \"copy/paste\" attacks in which one natural image is pasted into another to cause a targeted misclassification. Our results suggest that feature-level attacks are a promising approach for rigorous interpretability research. They support the design of tools to better understand what a model has learned and diagnose brittle feature associations. Code is available at this https URL\n"
  },
  {
    "Link": "https://llm-safety-challenges.github.io/",
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)",
      "Overview"
    ],
    "Title": "Foundational Challenges in Assuring Alignment and Safety of Large Language Models (Anwar et al., 2024)",
    "Type": [
      "Paper"
    ],
    "Abstract": "This work identifies 18 foundational challenges in assuring the alignment and safety of large language models (LLMs). These challenges are organized into three different categories: scientific understanding of LLMs, development and deployment methods, and sociotechnical challenges. Based on the identified challenges, we pose 200+, concrete research questions.\n"
  },
  {
    "Link": "https://www.neuronpedia.org/",
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge"
    ],
    "Safety Topic": [
      "Mechanistic interpretability"
    ],
    "Title": "Neuronpedia: a tool for visualising SAEs",
    "Type": [
      "Other"
    ],
    "Abstract": "Neuronpedia is a platform for interpretability research which allows you to visualise sparse autoencoders (SAEs).\n"
  },
  {
    "Link": "https://arxiv.org/abs/1810.08575",
    "ML Subfield": [
      "Model Evaluation"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Scalable oversight"
    ],
    "Title": "Supervising strong learners by amplifying weak experts (Christiano et al., 2018)",
    "Type": [
      "Paper"
    ],
    "Abstract": "    Many real world learning tasks involve complex or hard-to-specify objectives, and using an easier-to-specify proxy can lead to poor performance or misaligned behavior. One solution is to have humans provide a training signal by demonstrating or judging performance, but this approach fails if the task is too complicated for a human to directly evaluate. We propose Iterated Amplification, an alternative training strategy which progressively builds up a training signal for difficult problems by combining solutions to easier subproblems. Iterated Amplification is closely related to Expert Iteration (Anthony et al., 2017; Silver et al., 2017), except that it uses no external reward function. We present results in algorithmic environments, showing that Iterated Amplification can efficiently learn complex behaviors. \n"
  },
  {
    "Link": "https://rome.baulab.info/",
    "ML Subfield": [
      "NLP"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge"
    ],
    "Safety Topic": [
      "Model editing"
    ],
    "Title": "Locating and Editing Factual Associations in GPT (Meng et al., 2022)\n",
    "Type": [
      "Paper"
    ],
    "Abstract": "We analyze the storage and recall of factual associations in autoregressive transformer language models, finding evidence that these associations correspond to localized, directly-editable computations. We first develop a causal intervention for identifying neuron activations that are decisive in a model's factual predictions. This reveals a distinct set of steps in middle-layer feed-forward modules that mediate factual predictions while processing subject tokens. To test our hypothesis that these computations correspond to factual association recall, we modify feed-forward weights to update specific factual associations using Rank-One Model Editing (ROME). We find that ROME is effective on a standard zero-shot relation extraction (zsRE) model-editing task, comparable to existing methods. To perform a more sensitive evaluation, we also evaluate ROME on a new dataset of counterfactual assertions, on which it simultaneously maintains both specificity and generalization, whereas other methods sacrifice one or another. Our results confirm an important role for mid-layer feed-forward modules in storing factual associations and suggest that direct manipulation of computational mechanisms may be a feasible approach for model editing. The code, dataset, visualizations, and an interactive demo notebook are available at this https URL\n",
    "Transcripts / Audio / Slides": "https://preview.type3.audio/episode/agi-safety-fundamentals-alignment/c902ed39-f622-4296-b312-73339fab7b6e"
  },
  {
    "Link": "https://www.anthropic.com/index/core-views-on-ai-safety",
    "ML Subfield": [
      "Domain General"
    ],
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge",
      "Scalable oversight",
      "Alignment <-> RLHF",
      "Model evaluations / monitoring / detection",
      "AI Governance",
      "Overview"
    ],
    "Safety Topic": [
      "Mechanistic interpretability"
    ],
    "Title": "Core Views on AI Safety: When, Why, What, and How (Anthropic, 2023)",
    "Type": [
      "Blog post"
    ]
  },
  {
    "Link": "https://arxiv.org/abs/2308.12833",
    "ML Subfield": [
      "Robustness and Adversariality"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)",
      "Overview"
    ],
    "Title": "Use of LLMs for Illicit Purposes: Threats, Prevention Measures, and Vulnerabilities (Mozes et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": " Spurred by the recent rapid increase in the development and distribution of large language models (LLMs) across industry and academia, much recent work has drawn attention to safety- and security-related threats and vulnerabilities of LLMs, including in the context of potentially criminal activities. Specifically, it has been shown that LLMs can be misused for fraud, impersonation, and the generation of malware; while other authors have considered the more general problem of AI alignment. It is important that developers and practitioners alike are aware of security-related problems with such models. In this paper, we provide an overview of existing - predominantly scientific - efforts on identifying and mitigating threats and vulnerabilities arising from LLMs. We present a taxonomy describing the relationship between threats caused by the generative capabilities of LLMs, prevention measures intended to address such threats, and vulnerabilities arising from imperfect prevention measures. With our work, we hope to raise awareness of the limitations of LLMs in light of such security concerns, among both experienced developers and novel users of such technologies. \n"
  },
  {
    "Link": "https://www.neelnanda.io/mechanistic-interpretability/favourite-papers",
    "ML Subfield": [
      "Theory",
      "NLP"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge",
      "Overview"
    ],
    "Safety Topic": [
      "Mechanistic interpretability"
    ],
    "Title": "An Extremely Opinionated Annotated List of My Favourite Mechanistic Interpretability Papers (Nanda, 2023)",
    "Type": [
      "Blog post"
    ]
  },
  {
    "Blog or Video": "https://www.alignmentforum.org/posts/EPLk8QxETC5FEhoxK/arc-evals-new-report-evaluating-language-model-agents-on",
    "Link": "https://arxiv.org/abs/2312.11671",
    "ML Subfield": [
      "Model Evaluation",
      "NLP",
      "Applied ML"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Model evaluations / monitoring / detection"
    ],
    "Title": "Evaluating Language-Model Agents on Realistic Autonomous Tasks (Kinniment et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "In this report, we explore the ability of language model agents to acquire resources,create copies of themselves, and adapt to novel challenges they encounter inthe wild. We refer to this cluster of capabilities as “autonomous replication andadaptation” or ARA. We believe that systems capable of ARA could have wide-reaching and hard-to-anticipate consequences, and that measuring and forecastingARA may be useful for informing measures around security, monitoring, andalignment. Additionally, once a system is capable of ARA, placing bounds on asystem’s capabilities may become significantly more difficult.We construct four simple example agents that combine language models with toolsthat allow them to take actions in the world. We then evaluate these agents on 12tasks relevant to ARA. We find that these language model agents can only completethe easiest tasks from this list, although they make some progress on the morechallenging tasks. Unfortunately, these evaluations are not adequate to rule out thepossibility that near-future agents will be capable of ARA. In particular, we do notthink that these evaluations provide good assurance that the “next generation” oflanguage models (e.g. 100x effective compute scaleup on existing models) willnot yield agents capable of ARA, unless intermediate evaluations are performedduring pretraining. Relatedly, we expect that fine-tuning of the existing modelscould produce substantially more competent agents, even if the fine-tuning is notdirectly targeted at ARA.\n"
  },
  {
    "Link": "https://www.alignment-workshop.com/sf-talks/ajeya-cotra-situational-awareness-makes-measuring-safety-tricky",
    "ML Subfield": [
      "Human Model Interaction",
      "Domain General",
      "Applied ML"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Deception"
    ],
    "Safety Topic": [
      "Situational awareness (also instrumental convergence, inner misalignment)"
    ],
    "Title": " “Situational Awareness” Makes Measuring Safety Tricky (Ajeya Cotra, 40-min video)",
    "Type": [
      "Video"
    ]
  },
  {
    "Link": "https://arxiv.org/abs/2303.11341",
    "ML Subfield": [
      "Applied ML",
      "Domain General",
      "Human Model Interaction",
      "Security"
    ],
    "ML Subtopic": [
      "Applied ML: Efficiency and Hardware"
    ],
    "Safety Category": [
      "AI Governance"
    ],
    "Safety Topic": [
      "Compute governance"
    ],
    "Title": "What does it take to catch a Chinchilla? Verifying Rules on Large-Scale Neural Network Training via Compute Monitoring (Shavit, 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "As advanced machine learning systems' capabilities begin to play a significant role in geopolitics and societal order, it may become imperative that (1) governments be able to enforce rules on the development of advanced ML systems within their borders, and (2) countries be able to verify each other's compliance with potential future international agreements on advanced ML development. This work analyzes one mechanism to achieve this, by monitoring the computing hardware used for large-scale NN training. The framework's primary goal is to provide governments high confidence that no actor uses large quantities of specialized ML chips to execute a training run in violation of agreed rules. At the same time, the system does not curtail the use of consumer computing devices, and maintains the privacy and confidentiality of ML practitioners' models, data, and hyperparameters. The system consists of interventions at three stages: (1) using on-chip firmware to occasionally save snapshots of the the neural network weights stored in device memory, in a form that an inspector could later retrieve; (2) saving sufficient information about each training run to prove to inspectors the details of the training run that had resulted in the snapshotted weights; and (3) monitoring the chip supply chain to ensure that no actor can avoid discovery by amassing a large quantity of untracked chips. The proposed design decomposes the ML training rule verification problem into a series of narrow technical challenges, including a new variant of the Proof-of-Learning problem [Jia et al. '21].  \n"
  },
  {
    "Link": "https://arxiv.org/abs/2310.01405",
    "ML Subfield": [
      "NLP"
    ],
    "ML Subtopic": [
      "NLP: LLMs",
      "Applied ML: Chatbots"
    ],
    "Safety Category": [
      "Transparency / Interpretability / Model internals / Latent knowledge"
    ],
    "Safety Topic": [
      "Model editing"
    ],
    "Title": "Representation Engineering: A Top-Down Approach to AI Transparency (Zou et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "    In this paper, we identify and characterize the emerging area of representation engineering (RepE), an approach to enhancing the transparency of AI systems that draws on insights from cognitive neuroscience. RepE places population-level representations, rather than neurons or circuits, at the center of analysis, equipping us with novel methods for monitoring and manipulating high-level cognitive phenomena in deep neural networks (DNNs). We provide baselines and an initial analysis of RepE techniques, showing that they offer simple yet effective solutions for improving our understanding and control of large language models. We showcase how these methods can provide traction on a wide range of safety-relevant problems, including honesty, harmlessness, power-seeking, and more, demonstrating the promise of top-down transparency research. We hope that this work catalyzes further exploration of RepE and fosters advancements in the transparency and safety of AI systems. \n"
  },
  {
    "Link": "https://bounded-regret.ghost.io/future-ml-systems-will-be-qualitatively-different/",
    "ML Subfield": [
      "Domain General"
    ],
    "Safety Category": [
      "Forecasting",
      "Major problems (misalignment, misuse, threat models)"
    ],
    "Title": "Future ML Systems Will Be Qualitatively Different (Steinhardt, 2022)",
    "Type": [
      "Blog post"
    ]
  },
  {
    "Link": "https://arxiv.org/abs/1906.02530",
    "ML Subfield": [
      "Domain General",
      "Model Evaluation"
    ],
    "Safety Category": [
      "Model evaluations / monitoring / detection"
    ],
    "Safety Topic": [
      "Uncertainty"
    ],
    "Title": "Can You Trust Your Model’s Uncertainty? Evaluating Predictive Uncertainty Under Dataset Shift (Ovadia et al., 2019)\n",
    "Type": [
      "Paper"
    ],
    "Abstract": "Modern machine learning methods including deep learning have achieved great success in predictive accuracy for supervised learning tasks, but may still fall short in giving useful estimates of their predictive {\\em uncertainty}. Quantifying uncertainty is especially critical in real-world settings, which often involve input distributions that are shifted from the training distribution due to a variety of factors including sample bias and non-stationarity. In such settings, well calibrated uncertainty estimates convey information about when a model's output should (or should not) be trusted. Many probabilistic deep learning methods, including Bayesian-and non-Bayesian methods, have been proposed in the literature for quantifying predictive uncertainty, but to our knowledge there has not previously been a rigorous large-scale empirical comparison of these methods under dataset shift. We present a large-scale benchmark of existing state-of-the-art methods on classification problems and investigate the effect of dataset shift on accuracy and calibration. We find that traditional post-hoc calibration does indeed fall short, as do several other previous methods. However, some methods that marginalize over models give surprisingly strong results across a broad spectrum of tasks. \n"
  },
  {
    "Link": "https://arxiv.org/abs/2306.15447",
    "ML Subfield": [
      "Robustness and Adversariality",
      "Security"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Adversaries / Robustness / Generalization"
    ],
    "Title": "Are aligned neural networks adversarially aligned? (Carlini et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "Large language models are now tuned to align with the goals of their creators, namely to be \"helpful and harmless.\" These models should respond helpfully to user questions, but refuse to answer requests that could cause harm. However, adversarial users can construct inputs which circumvent attempts at alignment. In this work, we study to what extent these models remain aligned, even when interacting with an adversarial user who constructs worst-case inputs (adversarial examples). These inputs are designed to cause the model to emit harmful content that would otherwise be prohibited. We show that existing NLP-based optimization attacks are insufficiently powerful to reliably attack aligned text models: even when current NLP-based attacks fail, we can find adversarial inputs with brute force. As a result, the failure of current attacks should not be seen as proof that aligned text models remain aligned under adversarial inputs. However the recent trend in large-scale ML models is multimodal models that allow users to provide images that influence the text that is generated. We show these models can be easily attacked, i.e., induced to perform arbitrary un-aligned behavior through adversarial perturbation of the input image. We conjecture that improved NLP attacks may demonstrate this same level of adversarial control over text-only models. \n"
  },
  {
    "Link": "https://arxiv.org/abs/2209.07858",
    "ML Subfield": [
      "NLP",
      "Robustness and Adversariality",
      "Model Evaluation"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Adversaries / Robustness / Generalization"
    ],
    "Title": "Red Teaming Language Models to Reduce Harms: Methods, Scaling Behaviors, and Lessons Learned (Ganguli et al., 2022)",
    "Type": [
      "Paper"
    ],
    "Twitter": "https://twitter.com/AnthropicAI/status/1571988929800273932?lang=en",
    "Abstract": "    We describe our early efforts to red team language models in order to simultaneously discover, measure, and attempt to reduce their potentially harmful outputs. We make three main contributions. First, we investigate scaling behaviors for red teaming across 3 model sizes (2.7B, 13B, and 52B parameters) and 4 model types: a plain language model (LM); an LM prompted to be helpful, honest, and harmless; an LM with rejection sampling; and a model trained to be helpful and harmless using reinforcement learning from human feedback (RLHF). We find that the RLHF models are increasingly difficult to red team as they scale, and we find a flat trend with scale for the other model types. Second, we release our dataset of 38,961 red team attacks for others to analyze and learn from. We provide our own analysis of the data and find a variety of harmful outputs, which range from offensive language to more subtly harmful non-violent unethical outputs. Third, we exhaustively describe our instructions, processes, statistical methodologies, and uncertainty about red teaming. We hope that this transparency accelerates our ability to work together as a community in order to develop shared norms, practices, and technical standards for how to red team language models. \n"
  },
  {
    "Blog or Video": "https://www.alignment-workshop.com/nola-talks/owain-evans-out-of-context-reasoning-in-llms",
    "Link": "https://arxiv.org/abs/2309.00667",
    "ML Subfield": [
      "NLP",
      "Model Evaluation"
    ],
    "ML Subtopic": [
      "NLP: LLMs",
      "Applied ML: Chatbots"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)"
    ],
    "Safety Topic": [
      "Situational awareness (also instrumental convergence, inner misalignment)"
    ],
    "Title": "Taken out of context: On measuring situational awareness in LLMs (Berglund et al., 2023)",
    "Type": [
      "Video",
      "Paper"
    ],
    "Abstract": "We aim to better understand the emergence of \\`situational awareness' in large language models (LLMs). A model is situationally aware if it's aware that it's a model and can recognize whether it's currently in testing or deployment. Today's LLMs are tested for safety and alignment before they are deployed. An LLM could exploit situational awareness to achieve a high score on safety tests, while taking harmful actions after deployment. Situational awareness may emerge unexpectedly as a byproduct of model scaling. One way to better foresee this emergence is to run scaling experiments on abilities necessary for situational awareness. As such an ability, we propose \\`out-of-context reasoning' (in contrast to in-context learning). We study out-of-context reasoning experimentally. First, we finetune an LLM on a description of a test while providing no examples or demonstrations. At test time, we assess whether the model can pass the test. To our surprise, we find that LLMs succeed on this out-of-context reasoning task. Their success is sensitive to the training setup and only works when we apply data augmentation. For both GPT-3 and LLaMA-1, performance improves with model size. These findings offer a foundation for further empirical study, towards predicting and potentially controlling the emergence of situational awareness in LLMs. Code is available at: this https URL. \n"
  },
  {
    "Link": "https://arxiv.org/abs/2206.05862",
    "ML Subfield": [
      "Security",
      "Domain General",
      "Theory"
    ],
    "Safety Category": [
      "Major problems (misalignment, misuse, threat models)",
      "Overview"
    ],
    "Title": "X-Risk Analysis for AI Research (Hendrycks and Mazeika, 2022)",
    "Type": [
      "Paper"
    ],
    "Abstract": "    Artificial intelligence (AI) has the potential to greatly improve society, but as with any powerful technology, it comes with heightened risks and responsibilities. Current AI research lacks a systematic discussion of how to manage long-tail risks from AI systems, including speculative long-term risks. Keeping in mind the potential benefits of AI, there is some concern that building ever more intelligent and powerful AI systems could eventually result in systems that are more powerful than us; some say this is like playing with fire and speculate that this could create existential risks (x-risks). To add precision and ground these discussions, we provide a guide for how to analyze AI x-risk, which consists of three parts: First, we review how systems can be made safer today, drawing on time-tested concepts from hazard analysis and systems safety that have been designed to steer large processes in safer directions. Next, we discuss strategies for having long-term impacts on the safety of future systems. Finally, we discuss a crucial concept in making AI systems safer by improving the balance between safety and general capabilities. We hope this document and the presented concepts and tools serve as a useful guide for understanding how to analyze AI x-risk. \n"
  },
  {
    "Link": "https://openai.com/safety/preparedness",
    "ML Subfield": [
      "Model Evaluation"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Model evaluations / monitoring / detection"
    ],
    "Title": "OpenAI's Preparedness Framework",
    "Type": [
      "Blog post"
    ]
  },
  {
    "Link": "https://arxiv.org/abs/2301.10226",
    "ML Subfield": [
      "NLP",
      "Security"
    ],
    "ML Subtopic": [
      "NLP: LLMs"
    ],
    "Safety Category": [
      "Model evaluations / monitoring / detection"
    ],
    "Safety Topic": [
      "Security"
    ],
    "Title": "A Watermark for Large Language Models (Kirchenbauer et al., 2023)",
    "Type": [
      "Paper"
    ],
    "Abstract": "    Potential harms of large language models can be mitigated by watermarking model output, i.e., embedding signals into generated text that are invisible to humans but algorithmically detectable from a short span of tokens. We propose a watermarking framework for proprietary language models. The watermark can be embedded with negligible impact on text quality, and can be detected using an efficient open-source algorithm without access to the language model API or parameters. The watermark works by selecting a randomized set of \"green\" tokens before a word is generated, and then softly promoting use of green tokens during sampling. We propose a statistical test for detecting the watermark with interpretable p-values, and derive an information-theoretic framework for analyzing the sensitivity of the watermark. We test the watermark using a multi-billion parameter model from the Open Pretrained Transformer (OPT) family, and discuss robustness and security. \n"
  },
  {
    "Link": "https://arxiv.org/abs/1706.06083",
    "ML Subfield": [
      "Robustness and Adversariality",
      "Theory",
      "Optimization"
    ],
    "Safety Category": [
      "Adversaries / Robustness / Generalization"
    ],
    "Title": "Towards Deep Learning Models Resistant to Adversarial Attacks (Madry et al., 2018)",
    "Type": [
      "Paper"
    ],
    "Abstract": "Recent work has demonstrated that deep neural networks are vulnerable to adversarial examples---inputs that are almost indistinguishable from natural data and yet classified incorrectly by the network. In fact, some of the latest findings suggest that the existence of adversarial attacks may be an inherent weakness of deep learning models. To address this problem, we study the adversarial robustness of neural networks through the lens of robust optimization. This approach provides us with a broad and unifying view on much of the prior work on this topic. Its principled nature also enables us to identify methods for both training and attacking neural networks that are reliable and, in a certain sense, universal. In particular, they specify a concrete security guarantee that would protect against any adversary. These methods let us train networks with significantly improved resistance to a wide range of adversarial attacks. They also suggest the notion of security against a first-order adversary as a natural and broad security guarantee. We believe that robustness against such well-defined classes of adversaries is an important stepping stone towards fully resistant deep learning models. Code and pre-trained models are available at this https URL and this https URL. \n"
  }
]